In [2]:
import pandas as pd
import matplotlib.pyplot as plt

In [7]:
df = pd.read_csv('../data/census-income.data', header=None)

df.head(2)

,0,1,2,3,4,5,6,7,8,9,...,32,33,34,35,36,37,38,39,40,41
0,73,Not in universe,0,0,High school graduate,0,Not in universe,Widowed,Not in universe or children,Not in universe,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,2,0,95,- 50000.
1,58,Self-employed-not incorporated,4,34,Some college but no degree,0,Not in universe,Divorced,Construction,Precision production craft & repair,...,United-States,United-States,United-States,Native- Born in the United States,0,Not in universe,2,52,94,- 50000.

In [11]:
# Print the uniquecount of column 41 and the percentage of each unique value
print(df[41].value_counts())
print(df[41].value_counts(normalize=True) * 100)

 - 50000.    187141
 50000+.      12382
Name: 41, dtype: int64
 - 50000.    93.794199
 50000+.      6.205801
Name: 41, dtype: float64